tools/cfdvv/cases/verification/incompressible/taylor-green-vortex-2d/openfoam/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application icoFoam;
allowSystemOperations true;
startFrom startTime; startTime 0; stopAt endTime; endTime 0.3;
deltaT 0.05; writeControl runTime; writeInterval 0.05;
functions {
    sampleDict {
        type sets;
        libs ("libsampling.so");
        writeControl outputTime;
        interpolationScheme cellPoint;
        setFormat csv;
        fields (U p);
        sets (
            line_y0 {
                type lineUniform; axis x;
                start (0 0 0.05); end (6.28318 0 0.05); nPoints 80;
            }
        );
    }
}
