tools/cfdvv/cases/verification/incompressible/taylor-green-vortex-2d/openfoam/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
convertToMeters 1;
vertices (
    (0 0 0) (6.283185307179586 0 0) (6.283185307179586 6.283185307179586 0) (0 6.283185307179586 0)
    (0 0 0.1) (6.283185307179586 0 0.1) (6.283185307179586 6.283185307179586 0.1) (0 6.283185307179586 0.1)
);
blocks ( hex (0 1 2 3 4 5 6 7) (80 80 1) simpleGrading (1 1 1) );
edges ();
boundary (
    cyc_x0  { type cyclic; neighbourPatch cyc_x1; faces ((0 4 7 3)); }
    cyc_x1  { type cyclic; neighbourPatch cyc_x0; faces ((1 5 6 2)); }
    cyc_y0  { type cyclic; neighbourPatch cyc_y1; faces ((0 1 5 4)); }
    cyc_y1  { type cyclic; neighbourPatch cyc_y0; faces ((3 7 6 2)); }
    frontAndBack { type empty; faces ((0 3 2 1)(4 5 6 7)); }
);
