tools/cfdvv/cases/verification/incompressible/taylor-green-vortex-2d/openfoam/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField nonuniform List<vector> 6400(
(-0.0392295478639 0.0392295478639 0)
(-0.0389876846562 0.117446780384 0)
(-0.0385054494078 0.194939914448 0)
(-0.0377858152595 0.271231179115 0)
(-0.0368332189951 0.34585021337 0)
(-0.0356535336872 0.418336966052 0)
(-0.0342540324882 0.488244532228 0)
(-0.0326433437883 0.555141908504 0)
(-0.0308313980189 0.618616650311 0)
(-0.0288293664282 0.678277414758 0)
...
);
boundaryField {
    cyc_x0  { type cyclic; }
    cyc_x1  { type cyclic; }
    cyc_y0  { type cyclic; }
    cyc_y1  { type cyclic; }
    frontAndBack { type empty; }
}
