tools/cfdvv/cases/verification/incompressible/taylor-green-vortex-2d/openfoam/0/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions [0 2 -2 0 0 0 0];
internalField nonuniform List<scalar> 6400(
-0.498458666866564
-0.4923218135327011
-0.48019921656110365
-0.46238937452180506
-0.4393308248332897
-0.4115913455158279
-0.3798539746122692
-0.3449001915245544
-0.30759067439725835
-0.2688441073652432
...
);
boundaryField {
    cyc_x0  { type cyclic; }
    cyc_x1  { type cyclic; }
    cyc_y0  { type cyclic; }
    cyc_y1  { type cyclic; }
    frontAndBack { type empty; }
}
