tools/cfdvv/cases/verification/incompressible/taylor-green-vortex-2d/openfoam/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers {
    p { solver PCG; preconditioner DIC; tolerance 1e-08; relTol 0.01; }
    pFinal { solver PCG; preconditioner DIC; tolerance 1e-08; relTol 0.001; }
    U { solver PBiCG; preconditioner DILU; tolerance 1e-08; relTol 0.01; }
    UFinal { solver PBiCG; preconditioner DILU; tolerance 1e-08; relTol 0.001; }
}
PISO {
    nCorrectors 2;
    nNonOrthogonalCorrectors 0;
    pRefPoint (0.78539816339 0.78539816339 0.05);
    pRefValue 0;
}
