tools/cfdvv/cases/verification/incompressible/taylor-green-vortex-2d/openfoam/system/sampleDict
FoamFile { version 2.0; format ascii; class dictionary; object sampleDict; }
type sets;
libs (sampling);
setFormat csv;
fields (U p);
sets (
    line_y0 {
        type uniform; axis x;
        start (0 0 0.05); end (6.28318 0 0.05); nPoints 128;
    }
);
