tools/cfdvv/cases/verification/incompressible/taylor-green-vortex-2d/openfoam/system/setExprFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}

expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

        expression
        #{
            vector
            (
                -cos(pos().x())*sin(pos().y()),
                sin(pos().x())*cos(pos().y()),
                0
            )
        #};
    }

    p
    {
        field       p;
        dimensions  [0 2 -2 0 0 0 0];

        expression
        #{
            -0.25*(cos(2*pos().x()) + cos(2*pos().y()))
        #};
    }
);
