tools/cfdvv/cases/verification/incompressible/taylor-green-vortex-2d/openfoam/Allrun
#!/bin/bash
set -e; blockMesh; icoFoam
echo "Taylor-Green done."
